Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/getting_started_pic32ck_gc01_cult/firmware/src/packs/PIC32CK2051GC01144_DFP/component/oscctrl.h
#define OSCCTRL_INTFLAG_XOSCRDY_Pos           _UINT32_(0)                                          /* (OSCCTRL_INTFLAG) XOSC Ready Position */
#define OSCCTRL_INTFLAG_XOSCRDY_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_XOSCRDY_Pos)       /* (OSCCTRL_INTFLAG) XOSC Ready Mask */
#define OSCCTRL_INTFLAG_XOSCRDY(value)        (OSCCTRL_INTFLAG_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_XOSCFAIL_Pos          _UINT32_(1)                                          /* (OSCCTRL_INTFLAG) XOSC Startup Failure Position */
#define OSCCTRL_INTFLAG_XOSCFAIL_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_XOSCFAIL_Pos)      /* (OSCCTRL_INTFLAG) XOSC Startup Failure Mask */
#define OSCCTRL_INTFLAG_XOSCFAIL(value)       (OSCCTRL_INTFLAG_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCFAIL_Pos)) /* Assigment of value for XOSCFAIL in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_CLKFAIL_Pos           _UINT32_(2)                                          /* (OSCCTRL_INTFLAG) XOSC Clock Failure Position */
#define OSCCTRL_INTFLAG_CLKFAIL_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_CLKFAIL_Pos)       /* (OSCCTRL_INTFLAG) XOSC Clock Failure Mask */
#define OSCCTRL_INTFLAG_CLKFAIL(value)        (OSCCTRL_INTFLAG_CLKFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_CLKFAIL_Pos)) /* Assigment of value for CLKFAIL in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLRDY_Pos           _UINT32_(8)                                          /* (OSCCTRL_INTFLAG) DFLL Ready Position */
#define OSCCTRL_INTFLAG_DFLLRDY_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLRDY_Pos)       /* (OSCCTRL_INTFLAG) DFLL Ready Mask */
#define OSCCTRL_INTFLAG_DFLLRDY(value)        (OSCCTRL_INTFLAG_DFLLRDY_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLLOCK_Pos          _UINT32_(9)                                          /* (OSCCTRL_INTFLAG) DFLL Lock Position */
#define OSCCTRL_INTFLAG_DFLLLOCK_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLLOCK_Pos)      /* (OSCCTRL_INTFLAG) DFLL Lock Mask */
#define OSCCTRL_INTFLAG_DFLLLOCK(value)       (OSCCTRL_INTFLAG_DFLLLOCK_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLLOCK_Pos)) /* Assigment of value for DFLLLOCK in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLOVF_Pos           _UINT32_(10)                                         /* (OSCCTRL_INTFLAG) DFLL Tuner Overflow Position */
#define OSCCTRL_INTFLAG_DFLLOVF_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLOVF_Pos)       /* (OSCCTRL_INTFLAG) DFLL Tuner Overflow Mask */
#define OSCCTRL_INTFLAG_DFLLOVF(value)        (OSCCTRL_INTFLAG_DFLLOVF_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLOVF_Pos)) /* Assigment of value for DFLLOVF in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLUNF_Pos           _UINT32_(11)                                         /* (OSCCTRL_INTFLAG) DFLL Tuner Underflow Position */
#define OSCCTRL_INTFLAG_DFLLUNF_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLUNF_Pos)       /* (OSCCTRL_INTFLAG) DFLL Tuner Underflow Mask */
#define OSCCTRL_INTFLAG_DFLLUNF(value)        (OSCCTRL_INTFLAG_DFLLUNF_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLUNF_Pos)) /* Assigment of value for DFLLUNF in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLRCS_Pos           _UINT32_(12)                                         /* (OSCCTRL_INTFLAG) DFLL Reference Clock Stopped Position */
#define OSCCTRL_INTFLAG_DFLLRCS_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLRCS_Pos)       /* (OSCCTRL_INTFLAG) DFLL Reference Clock Stopped Mask */
#define OSCCTRL_INTFLAG_DFLLRCS(value)        (OSCCTRL_INTFLAG_DFLLRCS_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLFAIL_Pos          _UINT32_(13)                                         /* (OSCCTRL_INTFLAG) DFLL Startup Failure Position */
#define OSCCTRL_INTFLAG_DFLLFAIL_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLFAIL_Pos)      /* (OSCCTRL_INTFLAG) DFLL Startup Failure Mask */
#define OSCCTRL_INTFLAG_DFLLFAIL(value)       (OSCCTRL_INTFLAG_DFLLFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLFAIL_Pos)) /* Assigment of value for DFLLFAIL in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_PLL0LOCKR_Pos         _UINT32_(24)                                         /* (OSCCTRL_INTFLAG) PLL 0 Lock Rise Position */
#define OSCCTRL_INTFLAG_PLL0LOCKR_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_PLL0LOCKR_Pos)     /* (OSCCTRL_INTFLAG) PLL 0 Lock Rise Mask */
#define OSCCTRL_INTFLAG_PLL0LOCKR(value)      (OSCCTRL_INTFLAG_PLL0LOCKR_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_PLL0LOCKR_Pos)) /* Assigment of value for PLL0LOCKR in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_PLL0LOCKF_Pos         _UINT32_(25)                                         /* (OSCCTRL_INTFLAG) PLL 0 Lock Fall Position */
#define OSCCTRL_INTFLAG_PLL0LOCKF_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_PLL0LOCKF_Pos)     /* (OSCCTRL_INTFLAG) PLL 0 Lock Fall Mask */
#define OSCCTRL_INTFLAG_PLL0LOCKF(value)      (OSCCTRL_INTFLAG_PLL0LOCKF_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_PLL0LOCKF_Pos)) /* Assigment of value for PLL0LOCKF in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_Msk                   _UINT32_(0x03003F07)                                 /* (OSCCTRL_INTFLAG) Register Mask  */


/* -------- OSCCTRL_STATUS : (OSCCTRL Offset: 0x10) ( R/ 32) Status -------- */
#define OSCCTRL_STATUS_RESETVALUE             _UINT32_(0x00)                                       /*  (OSCCTRL_STATUS) Status  Reset Value */

#define OSCCTRL_STATUS_XOSCRDY_Pos            _UINT32_(0)                                          /* (OSCCTRL_STATUS) XOSC Ready Position */
#define OSCCTRL_STATUS_XOSCRDY_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCRDY_Pos)        /* (OSCCTRL_STATUS) XOSC Ready Mask */
#define OSCCTRL_STATUS_XOSCRDY(value)         (OSCCTRL_STATUS_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCFAIL_Pos           _UINT32_(1)                                          /* (OSCCTRL_STATUS) XOSC Startup Failure Position */
#define OSCCTRL_STATUS_XOSCFAIL_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCFAIL_Pos)       /* (OSCCTRL_STATUS) XOSC Startup Failure Mask */
#define OSCCTRL_STATUS_XOSCFAIL(value)        (OSCCTRL_STATUS_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCFAIL_Pos)) /* Assigment of value for XOSCFAIL in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_CLKFAIL_Pos            _UINT32_(2)                                          /* (OSCCTRL_STATUS) XOSC Clock Failure Position */
#define OSCCTRL_STATUS_CLKFAIL_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_CLKFAIL_Pos)        /* (OSCCTRL_STATUS) XOSC Clock Failure Mask */
#define OSCCTRL_STATUS_CLKFAIL(value)         (OSCCTRL_STATUS_CLKFAIL_Msk & (_UINT32_(value) << OSCCTRL_STATUS_CLKFAIL_Pos)) /* Assigment of value for CLKFAIL in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCCKSW_Pos           _UINT32_(3)                                          /* (OSCCTRL_STATUS) XOSC Clock Switch Position */
#define OSCCTRL_STATUS_XOSCCKSW_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCCKSW_Pos)       /* (OSCCTRL_STATUS) XOSC Clock Switch Mask */
#define OSCCTRL_STATUS_XOSCCKSW(value)        (OSCCTRL_STATUS_XOSCCKSW_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCCKSW_Pos)) /* Assigment of value for XOSCCKSW in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLRDY_Pos            _UINT32_(8)                                          /* (OSCCTRL_STATUS) DFLL Ready Position */
#define OSCCTRL_STATUS_DFLLRDY_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLRDY_Pos)        /* (OSCCTRL_STATUS) DFLL Ready Mask */
#define OSCCTRL_STATUS_DFLLRDY(value)         (OSCCTRL_STATUS_DFLLRDY_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLLOCK_Pos           _UINT32_(9)                                          /* (OSCCTRL_STATUS) DFLL Lock Position */
#define OSCCTRL_STATUS_DFLLLOCK_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLLOCK_Pos)       /* (OSCCTRL_STATUS) DFLL Lock Mask */
#define OSCCTRL_STATUS_DFLLLOCK(value)        (OSCCTRL_STATUS_DFLLLOCK_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLLOCK_Pos)) /* Assigment of value for DFLLLOCK in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLOVF_Pos            _UINT32_(10)                                         /* (OSCCTRL_STATUS) DFLL Tuner Overflow Position */
#define OSCCTRL_STATUS_DFLLOVF_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLOVF_Pos)        /* (OSCCTRL_STATUS) DFLL Tuner Overflow Mask */
#define OSCCTRL_STATUS_DFLLOVF(value)         (OSCCTRL_STATUS_DFLLOVF_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLOVF_Pos)) /* Assigment of value for DFLLOVF in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLUNF_Pos            _UINT32_(11)                                         /* (OSCCTRL_STATUS) DFLL Tuner Underflow Position */
#define OSCCTRL_STATUS_DFLLUNF_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLUNF_Pos)        /* (OSCCTRL_STATUS) DFLL Tuner Underflow Mask */
#define OSCCTRL_STATUS_DFLLUNF(value)         (OSCCTRL_STATUS_DFLLUNF_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLUNF_Pos)) /* Assigment of value for DFLLUNF in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLRCS_Pos            _UINT32_(12)                                         /* (OSCCTRL_STATUS) DFLL Reference Clock Stopped Position */
#define OSCCTRL_STATUS_DFLLRCS_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLRCS_Pos)        /* (OSCCTRL_STATUS) DFLL Reference Clock Stopped Mask */
#define OSCCTRL_STATUS_DFLLRCS(value)         (OSCCTRL_STATUS_DFLLRCS_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLFAIL_Pos           _UINT32_(13)                                         /* (OSCCTRL_STATUS) DFLL Startup Failure Position */
#define OSCCTRL_STATUS_DFLLFAIL_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLFAIL_Pos)       /* (OSCCTRL_STATUS) DFLL Startup Failure Mask */
#define OSCCTRL_STATUS_DFLLFAIL(value)        (OSCCTRL_STATUS_DFLLFAIL_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLFAIL_Pos)) /* Assigment of value for DFLLFAIL in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_PLL0LOCK_Pos           _UINT32_(24)                                         /* (OSCCTRL_STATUS) PLL 0 Lock Position */
#define OSCCTRL_STATUS_PLL0LOCK_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_PLL0LOCK_Pos)       /* (OSCCTRL_STATUS) PLL 0 Lock Mask */
#define OSCCTRL_STATUS_PLL0LOCK(value)        (OSCCTRL_STATUS_PLL0LOCK_Msk & (_UINT32_(value) << OSCCTRL_STATUS_PLL0LOCK_Pos)) /* Assigment of value for PLL0LOCK in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_Msk                    _UINT32_(0x01003F0F)                                 /* (OSCCTRL_STATUS) Register Mask  */


