Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/getting_started_pic32ck_gc01_cult/firmware/src/packs/PIC32CK2051GC01144_DFP/component/oscctrl.h
/* -------- OSCCTRL_XOSCCTRLA : (OSCCTRL Offset: 0x14) (R/W 32) External Multipurpose Crystal Oscillator Control A -------- */
#define OSCCTRL_XOSCCTRLA_RESETVALUE          _UINT32_(0xD00)                                      /*  (OSCCTRL_XOSCCTRLA) External Multipurpose Crystal Oscillator Control A  Reset Value */

#define OSCCTRL_XOSCCTRLA_ENABLE_Pos          _UINT32_(1)                                          /* (OSCCTRL_XOSCCTRLA) Oscillator Enable Position */
#define OSCCTRL_XOSCCTRLA_ENABLE_Msk          (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_ENABLE_Pos)      /* (OSCCTRL_XOSCCTRLA) Oscillator Enable Mask */
#define OSCCTRL_XOSCCTRLA_ENABLE(value)       (OSCCTRL_XOSCCTRLA_ENABLE_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_AGC_Pos             _UINT32_(2)                                          /* (OSCCTRL_XOSCCTRLA) Auto Gain Control Loop Enable Position */
#define OSCCTRL_XOSCCTRLA_AGC_Msk             (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_AGC_Pos)         /* (OSCCTRL_XOSCCTRLA) Auto Gain Control Loop Enable Mask */
#define OSCCTRL_XOSCCTRLA_AGC(value)          (OSCCTRL_XOSCCTRLA_AGC_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_AGC_Pos)) /* Assigment of value for AGC in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_XTALEN_Pos          _UINT32_(3)                                          /* (OSCCTRL_XOSCCTRLA) Crystal Oscillator Enable Position */
#define OSCCTRL_XOSCCTRLA_XTALEN_Msk          (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_XTALEN_Pos)      /* (OSCCTRL_XOSCCTRLA) Crystal Oscillator Enable Mask */
#define OSCCTRL_XOSCCTRLA_XTALEN(value)       (OSCCTRL_XOSCCTRLA_XTALEN_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_XTALEN_Pos)) /* Assigment of value for XTALEN in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_CFDEN_Pos           _UINT32_(4)                                          /* (OSCCTRL_XOSCCTRLA) Clock Failure Detector Enable Position */
#define OSCCTRL_XOSCCTRLA_CFDEN_Msk           (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_CFDEN_Pos)       /* (OSCCTRL_XOSCCTRLA) Clock Failure Detector Enable Mask */
#define OSCCTRL_XOSCCTRLA_CFDEN(value)        (OSCCTRL_XOSCCTRLA_CFDEN_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_CFDEN_Pos)) /* Assigment of value for CFDEN in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_SWBEN_Pos           _UINT32_(5)                                          /* (OSCCTRL_XOSCCTRLA) Xosc Clock Switch Back Enable Position */
#define OSCCTRL_XOSCCTRLA_SWBEN_Msk           (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_SWBEN_Pos)       /* (OSCCTRL_XOSCCTRLA) Xosc Clock Switch Back Enable Mask */
#define OSCCTRL_XOSCCTRLA_SWBEN(value)        (OSCCTRL_XOSCCTRLA_SWBEN_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_SWBEN_Pos)) /* Assigment of value for SWBEN in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_ONDEMAND_Pos        _UINT32_(7)                                          /* (OSCCTRL_XOSCCTRLA) On Demand Control Position */
#define OSCCTRL_XOSCCTRLA_ONDEMAND_Msk        (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_ONDEMAND_Pos)    /* (OSCCTRL_XOSCCTRLA) On Demand Control Mask */
#define OSCCTRL_XOSCCTRLA_ONDEMAND(value)     (OSCCTRL_XOSCCTRLA_ONDEMAND_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_STARTUP_Pos         _UINT32_(8)                                          /* (OSCCTRL_XOSCCTRLA) Start-Up Time Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_Msk         (_UINT32_(0xF) << OSCCTRL_XOSCCTRLA_STARTUP_Pos)     /* (OSCCTRL_XOSCCTRLA) Start-Up Time Mask */
#define OSCCTRL_XOSCCTRLA_STARTUP(value)      (OSCCTRL_XOSCCTRLA_STARTUP_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_STARTUP_Pos)) /* Assigment of value for STARTUP in the OSCCTRL_XOSCCTRLA register */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1_Val _UINT32_(0x0)                                        /* (OSCCTRL_XOSCCTRLA) 31 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2_Val _UINT32_(0x1)                                        /* (OSCCTRL_XOSCCTRLA) 61 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4_Val _UINT32_(0x2)                                        /* (OSCCTRL_XOSCCTRLA) 122 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8_Val _UINT32_(0x3)                                        /* (OSCCTRL_XOSCCTRLA) 244 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16_Val _UINT32_(0x4)                                        /* (OSCCTRL_XOSCCTRLA) 488 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32_Val _UINT32_(0x5)                                        /* (OSCCTRL_XOSCCTRLA) 977 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE64_Val _UINT32_(0x6)                                        /* (OSCCTRL_XOSCCTRLA) 1953 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE128_Val _UINT32_(0x7)                                        /* (OSCCTRL_XOSCCTRLA) 3906 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE256_Val _UINT32_(0x8)                                        /* (OSCCTRL_XOSCCTRLA) 7813 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE512_Val _UINT32_(0x9)                                        /* (OSCCTRL_XOSCCTRLA) 15625 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1024_Val _UINT32_(0xA)                                        /* (OSCCTRL_XOSCCTRLA) 31250 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2048_Val _UINT32_(0xB)                                        /* (OSCCTRL_XOSCCTRLA) 62500 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4096_Val _UINT32_(0xC)                                        /* (OSCCTRL_XOSCCTRLA) 125000 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8192_Val _UINT32_(0xD)                                        /* (OSCCTRL_XOSCCTRLA) 250000 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16384_Val _UINT32_(0xE)                                        /* (OSCCTRL_XOSCCTRLA) 500000 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32768_Val _UINT32_(0xF)                                        /* (OSCCTRL_XOSCCTRLA) 1000000 us  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1      (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 31 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2      (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 61 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4      (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 122 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8      (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 244 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16     (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 488 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32     (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 977 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE64     (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE64_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 1953 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE128    (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE128_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 3906 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE256    (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE256_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 7813 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE512    (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE512_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 15625 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1024   (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1024_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 31250 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2048   (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2048_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 62500 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4096   (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4096_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 125000 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8192   (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8192_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 250000 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16384  (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16384_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 500000 us Position  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32768  (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32768_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 1000000 us Position  */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_Pos        _UINT32_(16)                                         /* (OSCCTRL_XOSCCTRLA) Clock Failure Detector Prescaler Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_Msk        (_UINT32_(0xF) << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos)    /* (OSCCTRL_XOSCCTRLA) Clock Failure Detector Prescaler Mask */
#define OSCCTRL_XOSCCTRLA_CFDPRESC(value)     (OSCCTRL_XOSCCTRLA_CFDPRESC_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos)) /* Assigment of value for CFDPRESC in the OSCCTRL_XOSCCTRLA register */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV1_Val _UINT32_(0x0)                                        /* (OSCCTRL_XOSCCTRLA) 48 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV2_Val _UINT32_(0x1)                                        /* (OSCCTRL_XOSCCTRLA) 24 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV4_Val _UINT32_(0x2)                                        /* (OSCCTRL_XOSCCTRLA) 12 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV8_Val _UINT32_(0x3)                                        /* (OSCCTRL_XOSCCTRLA) 6 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV16_Val _UINT32_(0x4)                                        /* (OSCCTRL_XOSCCTRLA) 3 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV32_Val _UINT32_(0x5)                                        /* (OSCCTRL_XOSCCTRLA) 1.5 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV64_Val _UINT32_(0x6)                                        /* (OSCCTRL_XOSCCTRLA) 0.75 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV128_Val _UINT32_(0x7)                                        /* (OSCCTRL_XOSCCTRLA) 0.3125 MHz  */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV1       (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV1_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 48 MHz Position  */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV2       (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV2_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 24 MHz Position  */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV4       (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV4_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 12 MHz Position  */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV8       (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV8_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 6 MHz Position  */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV16      (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV16_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 3 MHz Position  */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV32      (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV32_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 1.5 MHz Position  */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV64      (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV64_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 0.75 MHz Position  */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV128     (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV128_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 0.3125 MHz Position  */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_Pos        _UINT32_(24)                                         /* (OSCCTRL_XOSCCTRLA) USBHS Referrence Clock Division Position */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_Msk        (_UINT32_(0x3) << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos)    /* (OSCCTRL_XOSCCTRLA) USBHS Referrence Clock Division Mask */
#define OSCCTRL_XOSCCTRLA_USBHSDIV(value)     (OSCCTRL_XOSCCTRLA_USBHSDIV_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos)) /* Assigment of value for USBHSDIV in the OSCCTRL_XOSCCTRLA register */
#define   OSCCTRL_XOSCCTRLA_USBHSDIV_DIS_Val  _UINT32_(0x0)                                        /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is disabled  */
#define   OSCCTRL_XOSCCTRLA_USBHSDIV_DIV1_Val _UINT32_(0x1)                                        /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 1  */
#define   OSCCTRL_XOSCCTRLA_USBHSDIV_DIV2_Val _UINT32_(0x2)                                        /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 2  */
#define   OSCCTRL_XOSCCTRLA_USBHSDIV_DIV3_Val _UINT32_(0x3)                                        /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 4  */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_DIS        (OSCCTRL_XOSCCTRLA_USBHSDIV_DIS_Val << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos) /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is disabled Position  */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_DIV1       (OSCCTRL_XOSCCTRLA_USBHSDIV_DIV1_Val << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos) /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 1 Position  */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_DIV2       (OSCCTRL_XOSCCTRLA_USBHSDIV_DIV2_Val << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos) /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 2 Position  */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_DIV3       (OSCCTRL_XOSCCTRLA_USBHSDIV_DIV3_Val << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos) /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 4 Position  */
#define OSCCTRL_XOSCCTRLA_WRTLOCK_Pos         _UINT32_(31)                                         /* (OSCCTRL_XOSCCTRLA) Write Lock for CTRLA register Position */
#define OSCCTRL_XOSCCTRLA_WRTLOCK_Msk         (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_WRTLOCK_Pos)     /* (OSCCTRL_XOSCCTRLA) Write Lock for CTRLA register Mask */
#define OSCCTRL_XOSCCTRLA_WRTLOCK(value)      (OSCCTRL_XOSCCTRLA_WRTLOCK_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_Msk                 _UINT32_(0x830F0FBE)                                 /* (OSCCTRL_XOSCCTRLA) Register Mask  */


/* -------- OSCCTRL_XOSCCTRLB : (OSCCTRL Offset: 0x18) (R/W 32) External Multipurpose Crystal Oscillator Control B -------- */
#define OSCCTRL_XOSCCTRLB_RESETVALUE          _UINT32_(0x00)                                       /*  (OSCCTRL_XOSCCTRLB) External Multipurpose Crystal Oscillator Control B  Reset Value */

#define OSCCTRL_XOSCCTRLB_USRCFG_Pos          _UINT32_(0)                                          /* (OSCCTRL_XOSCCTRLB) User Configuration Control Bits Position */
#define OSCCTRL_XOSCCTRLB_USRCFG_Msk          (_UINT32_(0xFF) << OSCCTRL_XOSCCTRLB_USRCFG_Pos)     /* (OSCCTRL_XOSCCTRLB) User Configuration Control Bits Mask */
#define OSCCTRL_XOSCCTRLB_USRCFG(value)       (OSCCTRL_XOSCCTRLB_USRCFG_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLB_USRCFG_Pos)) /* Assigment of value for USRCFG in the OSCCTRL_XOSCCTRLB register */
#define OSCCTRL_XOSCCTRLB_WRTLOCK_Pos         _UINT32_(31)                                         /* (OSCCTRL_XOSCCTRLB) Write Lock for CTRLB register Position */
#define OSCCTRL_XOSCCTRLB_WRTLOCK_Msk         (_UINT32_(0x1) << OSCCTRL_XOSCCTRLB_WRTLOCK_Pos)     /* (OSCCTRL_XOSCCTRLB) Write Lock for CTRLB register Mask */
#define OSCCTRL_XOSCCTRLB_WRTLOCK(value)      (OSCCTRL_XOSCCTRLB_WRTLOCK_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLB_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the OSCCTRL_XOSCCTRLB register */
#define OSCCTRL_XOSCCTRLB_Msk                 _UINT32_(0x800000FF)                                 /* (OSCCTRL_XOSCCTRLB) Register Mask  */


/* -------- OSCCTRL_DFLLCTRLA : (OSCCTRL Offset: 0x2C) (R/W 32) DFLL48M Control A -------- */
#define OSCCTRL_DFLLCTRLA_RESETVALUE          _UINT32_(0x82)                                       /*  (OSCCTRL_DFLLCTRLA) DFLL48M Control A  Reset Value */

#define OSCCTRL_DFLLCTRLA_ENABLE_Pos          _UINT32_(1)                                          /* (OSCCTRL_DFLLCTRLA) DFLL Enable Position */
#define OSCCTRL_DFLLCTRLA_ENABLE_Msk          (_UINT32_(0x1) << OSCCTRL_DFLLCTRLA_ENABLE_Pos)      /* (OSCCTRL_DFLLCTRLA) DFLL Enable Mask */
#define OSCCTRL_DFLLCTRLA_ENABLE(value)       (OSCCTRL_DFLLCTRLA_ENABLE_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the OSCCTRL_DFLLCTRLA register */
#define OSCCTRL_DFLLCTRLA_WRTLOCK_Pos         _UINT32_(2)                                          /* (OSCCTRL_DFLLCTRLA) Write Lock Position */
#define OSCCTRL_DFLLCTRLA_WRTLOCK_Msk         (_UINT32_(0x1) << OSCCTRL_DFLLCTRLA_WRTLOCK_Pos)     /* (OSCCTRL_DFLLCTRLA) Write Lock Mask */
#define OSCCTRL_DFLLCTRLA_WRTLOCK(value)      (OSCCTRL_DFLLCTRLA_WRTLOCK_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLA_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the OSCCTRL_DFLLCTRLA register */
#define OSCCTRL_DFLLCTRLA_LOWFREQ_Pos         _UINT32_(3)                                          /* (OSCCTRL_DFLLCTRLA) Low Frequency Mode Position */
#define OSCCTRL_DFLLCTRLA_LOWFREQ_Msk         (_UINT32_(0x1) << OSCCTRL_DFLLCTRLA_LOWFREQ_Pos)     /* (OSCCTRL_DFLLCTRLA) Low Frequency Mode Mask */
#define OSCCTRL_DFLLCTRLA_LOWFREQ(value)      (OSCCTRL_DFLLCTRLA_LOWFREQ_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLA_LOWFREQ_Pos)) /* Assigment of value for LOWFREQ in the OSCCTRL_DFLLCTRLA register */
#define OSCCTRL_DFLLCTRLA_ONDEMAND_Pos        _UINT32_(7)                                          /* (OSCCTRL_DFLLCTRLA) On Demand Control Position */
#define OSCCTRL_DFLLCTRLA_ONDEMAND_Msk        (_UINT32_(0x1) << OSCCTRL_DFLLCTRLA_ONDEMAND_Pos)    /* (OSCCTRL_DFLLCTRLA) On Demand Control Mask */
#define OSCCTRL_DFLLCTRLA_ONDEMAND(value)     (OSCCTRL_DFLLCTRLA_ONDEMAND_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLA_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OSCCTRL_DFLLCTRLA register */
#define OSCCTRL_DFLLCTRLA_Msk                 _UINT32_(0x0000008E)                                 /* (OSCCTRL_DFLLCTRLA) Register Mask  */


/* -------- OSCCTRL_DFLLCTRLB : (OSCCTRL Offset: 0x30) (R/W 32) DFLL48M Control B -------- */
#define OSCCTRL_DFLLCTRLB_RESETVALUE          _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLCTRLB) DFLL48M Control B  Reset Value */

#define OSCCTRL_DFLLCTRLB_LOOPEN_Pos          _UINT32_(0)                                          /* (OSCCTRL_DFLLCTRLB) Operating Mode Selection Position */
#define OSCCTRL_DFLLCTRLB_LOOPEN_Msk          (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_LOOPEN_Pos)      /* (OSCCTRL_DFLLCTRLB) Operating Mode Selection Mask */
#define OSCCTRL_DFLLCTRLB_LOOPEN(value)       (OSCCTRL_DFLLCTRLB_LOOPEN_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_LOOPEN_Pos)) /* Assigment of value for LOOPEN in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_STABLE_Pos          _UINT32_(1)                                          /* (OSCCTRL_DFLLCTRLB) Stable DFLL Frequency Position */
#define OSCCTRL_DFLLCTRLB_STABLE_Msk          (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_STABLE_Pos)      /* (OSCCTRL_DFLLCTRLB) Stable DFLL Frequency Mask */
#define OSCCTRL_DFLLCTRLB_STABLE(value)       (OSCCTRL_DFLLCTRLB_STABLE_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_STABLE_Pos)) /* Assigment of value for STABLE in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_LLAW_Pos            _UINT32_(2)                                          /* (OSCCTRL_DFLLCTRLB) Lose Lock After Wake Position */
#define OSCCTRL_DFLLCTRLB_LLAW_Msk            (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_LLAW_Pos)        /* (OSCCTRL_DFLLCTRLB) Lose Lock After Wake Mask */
#define OSCCTRL_DFLLCTRLB_LLAW(value)         (OSCCTRL_DFLLCTRLB_LLAW_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_LLAW_Pos)) /* Assigment of value for LLAW in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_USBCRM_Pos          _UINT32_(3)                                          /* (OSCCTRL_DFLLCTRLB) USB Clock Recovery Mode Position */
#define OSCCTRL_DFLLCTRLB_USBCRM_Msk          (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_USBCRM_Pos)      /* (OSCCTRL_DFLLCTRLB) USB Clock Recovery Mode Mask */
#define OSCCTRL_DFLLCTRLB_USBCRM(value)       (OSCCTRL_DFLLCTRLB_USBCRM_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_USBCRM_Pos)) /* Assigment of value for USBCRM in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_CCDIS_Pos           _UINT32_(4)                                          /* (OSCCTRL_DFLLCTRLB) Chill Cycle Disable Position */
#define OSCCTRL_DFLLCTRLB_CCDIS_Msk           (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_CCDIS_Pos)       /* (OSCCTRL_DFLLCTRLB) Chill Cycle Disable Mask */
#define OSCCTRL_DFLLCTRLB_CCDIS(value)        (OSCCTRL_DFLLCTRLB_CCDIS_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_CCDIS_Pos)) /* Assigment of value for CCDIS in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_QLDIS_Pos           _UINT32_(5)                                          /* (OSCCTRL_DFLLCTRLB) Quick Lock Disable Position */
#define OSCCTRL_DFLLCTRLB_QLDIS_Msk           (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_QLDIS_Pos)       /* (OSCCTRL_DFLLCTRLB) Quick Lock Disable Mask */
#define OSCCTRL_DFLLCTRLB_QLDIS(value)        (OSCCTRL_DFLLCTRLB_QLDIS_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_QLDIS_Pos)) /* Assigment of value for QLDIS in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_WAITLOCK_Pos        _UINT32_(7)                                          /* (OSCCTRL_DFLLCTRLB) Wait Lock Position */
#define OSCCTRL_DFLLCTRLB_WAITLOCK_Msk        (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_WAITLOCK_Pos)    /* (OSCCTRL_DFLLCTRLB) Wait Lock Mask */
#define OSCCTRL_DFLLCTRLB_WAITLOCK(value)     (OSCCTRL_DFLLCTRLB_WAITLOCK_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_WAITLOCK_Pos)) /* Assigment of value for WAITLOCK in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_Msk                 _UINT32_(0x000000BF)                                 /* (OSCCTRL_DFLLCTRLB) Register Mask  */


/* -------- OSCCTRL_DFLLTUNE : (OSCCTRL Offset: 0x34) (R/W 32) DFLL48M Tune -------- */
#define OSCCTRL_DFLLTUNE_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLTUNE) DFLL48M Tune  Reset Value */

#define OSCCTRL_DFLLTUNE_TUNE_Pos             _UINT32_(0)                                          /* (OSCCTRL_DFLLTUNE) Tune Value Position */
#define OSCCTRL_DFLLTUNE_TUNE_Msk             (_UINT32_(0x7F) << OSCCTRL_DFLLTUNE_TUNE_Pos)        /* (OSCCTRL_DFLLTUNE) Tune Value Mask */
#define OSCCTRL_DFLLTUNE_TUNE(value)          (OSCCTRL_DFLLTUNE_TUNE_Msk & (_UINT32_(value) << OSCCTRL_DFLLTUNE_TUNE_Pos)) /* Assigment of value for TUNE in the OSCCTRL_DFLLTUNE register */
#define OSCCTRL_DFLLTUNE_Msk                  _UINT32_(0x0000007F)                                 /* (OSCCTRL_DFLLTUNE) Register Mask  */


/* -------- OSCCTRL_DFLLDIFF : (OSCCTRL Offset: 0x38) ( R/ 32) DFLL48M Diff -------- */
#define OSCCTRL_DFLLDIFF_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLDIFF) DFLL48M Diff  Reset Value */

#define OSCCTRL_DFLLDIFF_DIFF_Pos             _UINT32_(0)                                          /* (OSCCTRL_DFLLDIFF) Multiplication Ratio Difference Position */
#define OSCCTRL_DFLLDIFF_DIFF_Msk             (_UINT32_(0xFFFF) << OSCCTRL_DFLLDIFF_DIFF_Pos)      /* (OSCCTRL_DFLLDIFF) Multiplication Ratio Difference Mask */
#define OSCCTRL_DFLLDIFF_DIFF(value)          (OSCCTRL_DFLLDIFF_DIFF_Msk & (_UINT32_(value) << OSCCTRL_DFLLDIFF_DIFF_Pos)) /* Assigment of value for DIFF in the OSCCTRL_DFLLDIFF register */
#define OSCCTRL_DFLLDIFF_Msk                  _UINT32_(0x0000FFFF)                                 /* (OSCCTRL_DFLLDIFF) Register Mask  */


